hao507/s32k1xxxwork/pps雷达同步信号/include/S32K116(2).h
/** CMU_FC - Size of Registers Arrays */

/** CMU_FC - Register Layout Typedef */
typedef struct {
  __IO uint32_t GCR;                               /**< CMU Frequency Check Global Configuration Register, offset: 0x0 */
  __IO uint32_t RCCR;                              /**< CMU Frequency Check Reference Count Configuration Register, offset: 0x4 */
  __IO uint32_t HTCR;                              /**< CMU Frequency Check High Threshold Configuration Register, offset: 0x8 */
  __IO uint32_t LTCR;                              /**< CMU Frequency Check Low Threshold Configuration Register, offset: 0xC */
  __IO uint32_t SR;                                /**< CMU Frequency Check Status Register, offset: 0x10 */
  __IO uint32_t IER;                               /**< CMU Frequency Check Interrupt/Event Enable Register, offset: 0x14 */
} CMU_FC_Type, *CMU_FC_MemMapPtr;

 /** Number of instances of the CMU_FC module. */
#define CMU_FC_INSTANCE_COUNT                    (2u)


/* CMU_FC - Peripheral instance base addresses */
/** Peripheral CMU_FC_0 base address */
#define CMU_FC_0_BASE                            (0x4003E000u)
/** Peripheral CMU_FC_0 base pointer */
#define CMU_FC_0                                 ((CMU_FC_Type *)CMU_FC_0_BASE)
/** Peripheral CMU_FC_1 base address */
#define CMU_FC_1_BASE                            (0x4003F000u)
/** Peripheral CMU_FC_1 base pointer */
#define CMU_FC_1                                 ((CMU_FC_Type *)CMU_FC_1_BASE)
/** Array initializer of CMU_FC peripheral base addresses */
#define CMU_FC_BASE_ADDRS                        { CMU_FC_0_BASE, CMU_FC_1_BASE }
/** Array initializer of CMU_FC peripheral base pointers */
#define CMU_FC_BASE_PTRS                         { CMU_FC_0, CMU_FC_1 }
 /** Number of interrupt vector arrays for the CMU_FC module. */
#define CMU_FC_IRQS_ARR_COUNT                    (1u)
 /** Number of interrupt channels for the CMU_FC module. */
#define CMU_FC_IRQS_CH_COUNT                     (1u)
/** Interrupt vectors for the CMU_FC peripheral type */
#define CMU_FC_IRQS                              { SCG_CMU_LVD_LVWSCG_IRQn, SCG_CMU_LVD_LVWSCG_IRQn }

/* ----------------------------------------------------------------------------
   -- CMU_FC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMU_FC_Register_Masks CMU_FC Register Masks
 * @{
 */

/* GCR Bit Fields */
#define CMU_FC_GCR_FCE_MASK                      0x1u
#define CMU_FC_GCR_FCE_SHIFT                     0u
#define CMU_FC_GCR_FCE_WIDTH                     1u
#define CMU_FC_GCR_FCE(x)                        (((uint32_t)(((uint32_t)(x))<<CMU_FC_GCR_FCE_SHIFT))&CMU_FC_GCR_FCE_MASK)
/* RCCR Bit Fields */
#define CMU_FC_RCCR_REF_CNT_MASK                 0xFFFFu
#define CMU_FC_RCCR_REF_CNT_SHIFT                0u
#define CMU_FC_RCCR_REF_CNT_WIDTH                16u
#define CMU_FC_RCCR_REF_CNT(x)                   (((uint32_t)(((uint32_t)(x))<<CMU_FC_RCCR_REF_CNT_SHIFT))&CMU_FC_RCCR_REF_CNT_MASK)
/* HTCR Bit Fields */
#define CMU_FC_HTCR_HFREF_MASK                   0xFFFFFFu
#define CMU_FC_HTCR_HFREF_SHIFT                  0u
#define CMU_FC_HTCR_HFREF_WIDTH                  24u
#define CMU_FC_HTCR_HFREF(x)                     (((uint32_t)(((uint32_t)(x))<<CMU_FC_HTCR_HFREF_SHIFT))&CMU_FC_HTCR_HFREF_MASK)
/* LTCR Bit Fields */
#define CMU_FC_LTCR_LFREF_MASK                   0xFFFFFFu
#define CMU_FC_LTCR_LFREF_SHIFT                  0u
#define CMU_FC_LTCR_LFREF_WIDTH                  24u
#define CMU_FC_LTCR_LFREF(x)                     (((uint32_t)(((uint32_t)(x))<<CMU_FC_LTCR_LFREF_SHIFT))&CMU_FC_LTCR_LFREF_MASK)
/* SR Bit Fields */
#define CMU_FC_SR_FLL_MASK                       0x1u
#define CMU_FC_SR_FLL_SHIFT                      0u
#define CMU_FC_SR_FLL_WIDTH                      1u
#define CMU_FC_SR_FLL(x)                         (((uint32_t)(((uint32_t)(x))<<CMU_FC_SR_FLL_SHIFT))&CMU_FC_SR_FLL_MASK)
#define CMU_FC_SR_FHH_MASK                       0x2u
#define CMU_FC_SR_FHH_SHIFT                      1u
#define CMU_FC_SR_FHH_WIDTH                      1u
#define CMU_FC_SR_FHH(x)                         (((uint32_t)(((uint32_t)(x))<<CMU_FC_SR_FHH_SHIFT))&CMU_FC_SR_FHH_MASK)
#define CMU_FC_SR_STATE_MASK                     0xCu
#define CMU_FC_SR_STATE_SHIFT                    2u
#define CMU_FC_SR_STATE_WIDTH                    2u
#define CMU_FC_SR_STATE(x)                       (((uint32_t)(((uint32_t)(x))<<CMU_FC_SR_STATE_SHIFT))&CMU_FC_SR_STATE_MASK)
#define CMU_FC_SR_RS_MASK                        0x10u
#define CMU_FC_SR_RS_SHIFT                       4u
#define CMU_FC_SR_RS_WIDTH                       1u
#define CMU_FC_SR_RS(x)                          (((uint32_t)(((uint32_t)(x))<<CMU_FC_SR_RS_SHIFT))&CMU_FC_SR_RS_MASK)
/* IER Bit Fields */
#define CMU_FC_IER_FLLIE_MASK                    0x1u
#define CMU_FC_IER_FLLIE_SHIFT                   0u
#define CMU_FC_IER_FLLIE_WIDTH                   1u
#define CMU_FC_IER_FLLIE(x)                      (((uint32_t)(((uint32_t)(x))<<CMU_FC_IER_FLLIE_SHIFT))&CMU_FC_IER_FLLIE_MASK)
#define CMU_FC_IER_FHHIE_MASK                    0x2u
#define CMU_FC_IER_FHHIE_SHIFT                   1u
#define CMU_FC_IER_FHHIE_WIDTH                   1u
#define CMU_FC_IER_FHHIE(x)                      (((uint32_t)(((uint32_t)(x))<<CMU_FC_IER_FHHIE_SHIFT))&CMU_FC_IER_FHHIE_MASK)
#define CMU_FC_IER_FLLAEE_MASK                   0x4u
#define CMU_FC_IER_FLLAEE_SHIFT                  2u
#define CMU_FC_IER_FLLAEE_WIDTH                  1u
#define CMU_FC_IER_FLLAEE(x)                     (((uint32_t)(((uint32_t)(x))<<CMU_FC_IER_FLLAEE_SHIFT))&CMU_FC_IER_FLLAEE_MASK)
#define CMU_FC_IER_FHHAEE_MASK                   0x8u
#define CMU_FC_IER_FHHAEE_SHIFT                  3u
#define CMU_FC_IER_FHHAEE_WIDTH                  1u
#define CMU_FC_IER_FHHAEE(x)                     (((uint32_t)(((uint32_t)(x))<<CMU_FC_IER_FHHAEE_SHIFT))&CMU_FC_IER_FHHAEE_MASK)

/*!
 * @}
 */ /* end of group CMU_FC_Register_Masks */


/*!
 * @}
 */ /* end of group CMU_FC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CRC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CRC_Peripheral_Access_Layer CRC Peripheral Access Layer
 * @{
 */


/** CRC - Size of Registers Arrays */

